r = '([\w\.-]+)@([\w\.-]+)(\.[\w\.]+)'
# lol = 'melen1um202@mail.ru'
import re
def relol():
    lol = input('Введите адрес вашего почтового ящика: ')
    match = re.search (r, lol)
    if match:
        print(match.group())
        print('Введенный вами адрес электронной почты соответствует формату почтового ящика.\nПисьмо от лица администрации было отправлено.')
    else:
        print('Введенный вами адрес электронной почты не соответствует формату почтового ящика.\nПожалуйста, убедитесь, что вы всё правильно написали')
        relol()

relol()
